Examinator/src/Catalogs/ШаблоныСертификатовСУО/ШаблоныСертификатовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныСертификатовСУО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабличныйМакет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматHTML</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматPDF</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоЭлементаСправочникаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПеременные</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПеременной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ШаблоныСертификатовСУО/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.Текст = Справочники.ШаблоныСертификатовСУО.ПолучитьМакет("МакетHTMLПоУмолчанию").ПолучитьТекст();
		ТабличныйМакет = Справочники.ШаблоныСертификатовСУО.ПолучитьМакет("МакетPDFПоУмолчанию");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ТабличныйМакет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ЗначениеКопирования, "ТабличныйМакет").Получить();
	КонецЕсли;
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьДоступностьЭлементовФормы();
	ТабличныйМакетИзБД = ТекущийОбъект.ТабличныйМакет.Получить();
	Если ТабличныйМакетИзБД = Неопределено Тогда
		ТабличныйМакет = Справочники.ШаблоныСертификатовСУО.ПолучитьМакет("МакетPDFПоУмолчанию");
	Иначе
		ТабличныйМакет = ТабличныйМакетИзБД;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ТабличныйМакет = Новый ХранилищеЗначения(ТабличныйМакет);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДополнительныеПеременные

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ДополнительныеПеременные

&НаКлиенте
Процедура ДополнительныеПеременныеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока И Элемент.ТекущиеДанные <> Неопределено Тогда
		Элемент.ТекущиеДанные.ИмяПеременной =  ИмяПеременной(Элемент.ТекущиеДанные.Переменная);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ФорматHTMLПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ФорматPDFПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервереБезКонтекста 
Функция ИмяПеременной(Знач СсылкаНаПеременную)
	Если ТипЗнч(СсылкаНаПеременную) = Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения") Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаПеременную, "Заголовок");
	Иначе		
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаПеременную, "Наименование");
	КонецЕсли;
КонецФункции

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	
	Элементы.СтраницаШаблонHTML.Видимость = Объект.ФорматHTML;
	Элементы.СтраницаШаблонPDF.Видимость = Объект.ФорматPDF;
	
КонецПроцедуры

#КонецОбласти
